emacs.org
#+TITLE: Literate .emacs
#+AUTHOR: Long Ouyang
#+PROPERTY: tangle yes
#+HIDESTARS: yes

* Load path

The normal-top-level-add-subdirs-to-load-path bit is HT http://emacswiki.org/emacs/LoadPath

#+BEGIN_SRC emacs-lisp
(let ((default-directory "~/dot-emacs/"))
      (normal-top-level-add-subdirs-to-load-path))
(add-to-list 'load-path "~/dot-emacs/")
#+END_SRC

* Copy important environment variables from my shell into emacs exec-path
 
HT https://github.com/purcell/exec-path-from-shell
  
2013/09/30, downloaded raw file from github and added here 

#+begin_src emacs-lisp
(load "exec-path-from-shell.el")
(exec-path-from-shell-initialize)
#+end_src

* Environment variables
  #+begin_src emacs-lisp
  (setenv "PATH" (concat "/usr/texbin" ":" (getenv "PATH")))
  #+end_src

  Make C-x f use HOME as the default directory
  #+BEGIN_SRC emacs-lisp
  (setq default-directory (concat (getenv "HOME") "/"))
  #+END_SRC
  
* Backups

#+BEGIN_SRC emacs-lisp
;; this no longer worked on my 24.3 install on mavericks
; (defun make-backup-file-name (file)
;   (concat "~/.emacs_backups/" (file-name-nondirectory file) "~"))

;; HT http://stackoverflow.com/a/151946
(setq backup-directory-alist '(("." . "~/.emacs_backups")))
#+END_SRC

* Search

** Auto wrap isearch
#+BEGIN_SRC emacs-lisp
(defadvice isearch-repeat (after isearch-no-fail activate)
  (unless isearch-success
    (ad-disable-advice 'isearch-repeat 'after 'isearch-no-fail)
    (ad-activate 'isearch-repeat)
    (isearch-repeat (if isearch-forward 'forward))
    (ad-enable-advice 'isearch-repeat 'after 'isearch-no-fail)
    (ad-activate 'isearch-repeat)))

(defadvice isearch-search (after isearch-no-fail activate)
  (unless isearch-success
    (ad-disable-advice 'isearch-search 'after 'isearch-no-fail)
    (ad-activate 'isearch-search)
    (isearch-repeat (if isearch-forward 'forward))
    (ad-enable-advice 'isearch-search 'after 'isearch-no-fail)
    (ad-activate 'isearch-search)))
#+END_SRC

* Appearance
** Disable splash screen, scroll bar, toolbar, reduce fringe

Disabling scroll bars w/o custom-set-variable: http://emacswiki.org/emacs/ScrollBar

#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (setq inhibit-splash-screen t)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (fringe-mode '(4 . 4))
)
#+END_SRC

** Solarized
NB: need to have iterm2 set to report TERM=xterm-16color
for solarized colors to look right in terminal
(https://github.com/sellout/emacs-color-theme-solarized/issues/71)

#+BEGIN_SRC emacs-lisp
(add-to-list 'custom-theme-load-path "~/dot-emacs/vendor/solarized")
(load-theme 'solarized-light t)
#+END_SRC

disable theme before switching using =load-theme=
http://stackoverflow.com/a/15595000/351392
#+BEGIN_SRC emacs-lisp
(defadvice load-theme 
  (before theme-dont-propagate activate)
  (mapcar #'disable-theme custom-enabled-themes))
#+END_SRC

** Use Inconsolata font
#+BEGIN_SRC emacs-lisp
(when (member "Inconsolata" (font-family-list))
	    (set-default-font "Inconsolata")
	    (set-face-attribute 'default nil :font "Inconsolata" :height 140))
#+END_SRC

** Colors in shell mode
FIXME
#+BEGIN_SRC emacs-lisp
(autoload 'ansi-color-for-comint-mode-on "ansi-color" nil t)
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
#+END_SRC

* Expand-region
#+begin_src emacs-lisp
(require 'expand-region)
(global-set-key (kbd "C-.") 'er/expand-region)
#+end_src
* yasnippet
#+begin_src emacs-lisp
(require 'yasnippet)
(add-to-list 'yas-snippet-dirs "~/dot-emacs/snippets/ess-mode")
(yas-global-mode 1)
#+end_src
* ESS
#+BEGIN_SRC emacs-lisp
(require 'ess-site)
(ess-toggle-underscore nil)

(load "htmlize.el")
#+END_SRC


  keyboard shortcut for eval-buffer-and-go
  #+BEGIN_SRC emacs-lisp
(add-hook 'ess-mode-hook (lambda ()
                           (local-set-key (kbd "s-r") 'ess-eval-buffer-and-go)))
  #+END_SRC

  #+RESULTS:
  | lambda | nil | (local-set-key (kbd s-r) (quote ess-eval-buffer-and-go)) |

  inferior-ess-mode-hook
  #+BEGIN_SRC emacs-lisp
(add-hook 'inferior-ess-mode-hook (lambda ()
                                    (progn
                                      (set-variable 'comint-scroll-to-bottom-on-output 'this)
                                      (set-variable 'comint-scroll-show-maximum-output t)
                                      (set-variable 'comint-scroll-to-bottom-on-input 'this))))

  #+END_SRC

  #+RESULTS:
  | lambda | nil | (progn (set-variable (quote comint-scroll-to-bottom-on-output) (quote this)) (set-variable (quote comint-scroll-show-maximum-output) t) (set-variable (quote comint-scroll-to-bottom-on-input) (quote this))) |



* Major modes
** Org
*** visual line mode
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook (lambda ()
                           (visual-line-mode 1)))
#+END_SRC
    
*** example blocks background

    #+begin_example
    
    #+end_example
    
*** src indentation 
HT http://stackoverflow.com/questions/9764583/strange-indentation-within-emacs-org-mode-src-block

#+begin_src emacs-lisp
(setq org-src-preserve-indentation t)
#+end_src

*** Load languages

#+BEGIN_SRC emacs-lisp
(require 'org)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)
   (emacs-lisp . t)
   (ruby . t)
   (sh . t)
   (python .t)
   (scheme . t)
   ))

(setq org-src-fontify-natively t)
(setq org-src-window-setup (quote current-window))
(setq org-confirm-babel-evaluate nil)
#+END_SRC

*** Open URLs in Chrome
#+BEGIN_SRC emacs-lisp
(defun open-url-in-chrome (url)
  "Open URL in Google Chrome.  I use AppleScript to do several things:
  1. I tell Chrome to come to the front. If Chrome wasn't launched, this will also launch it.
  2. If Chrome has no windows open, I tell it to create one.
  3. If Chrome has a tab showing URL, I tell it to reload the tab, make that tab the active tab in its window, and bring its window to the front.
  4. If Chrome has no tab showing URL, I tell Chrome to make a new tab (in the front window) showing URL."
  (when (symbolp url)
    ; User passed a symbol instead of a string.  Use the symbol name.
    (setq url (symbol-name url)))
  (do-applescript (format "
tell application \"Google Chrome\"
        activate
        set theUrl to %S
        if character 1 of theUrl is \"/\" then
                set theUrl to \"file://\" & theUrl
        end if

        if (count every window) = 0 then
                make new window
                set URL of active tab of window 1 to theURL
        end if


        set found to false
        set theTabIndex to -1
        repeat with theWindow in every window
                set theTabIndex to 0
                repeat with theTab in every tab of theWindow
                        set theTabIndex to theTabIndex + 1
                        if theTab's URL = theUrl then
                                set found to true
                                exit
                        end if
                end repeat

                if found then
                        exit repeat
                end if
        end repeat

        if found then
                tell theTab to reload
                set theWindow's active tab index to theTabIndex
                set index of theWindow to 1
        else
               set theTab to make new tab at end of tabs of window 1
               set URL of theTab to theURL
        end if
end tell" url)))

(defun replace-org-export-as-html-and-open ()
  (defun org-export-as-html-and-open (arg)
    "long"
    (interactive "P")
    (org-export-as-html arg 'hidden)
    (message buffer-file-name)
    (open-url-in-chrome buffer-file-name)
    (when org-export-kill-product-buffer-when-displayed
      (kill-buffer (current-buffer))))
)

(add-hook 'org-mode-hook 'replace-org-export-as-html-and-open)
#+END_SRC

