emacs.org
*** LaTeX

FIXME. Oh god this is a shambles.

cribbed a bunch from http://kieranhealy.org/blog/archives/2011/01/21/exporting-org-mode-to-pdf-via-xelatex/

#+BEGIN_SRC emacs-lisp

;; (require 'org-latex)
;; (setq org-export-latex-listings t)

;; (defun my-auto-tex-cmd ()
;;   "When exporting from .org with latex, automatically run latex,
;;    pdflatex, or xelatex as appropriate, using latemxk."
;;   (let ((texcmd)))
;;     ;; default command: oldstyle latex via dvi
;;     (setq texcmd "latexmk -dvi -pdfps %f")
;;     ;; pdflatex -> .pdf
;;     (if (string-match "LATEX_CMD: pdflatex" (buffer-string))
;; 	(setq texcmd "latexmk -pdf %f"))
;;     ;; xelatex -> .pdf
;;     (if (string-match "LATEX_CMD: xelatex" (buffer-string))
;; 	(setq texcmd "latexmk -pdflatex=xelatex -pdf %f"))
;;     (setq org-latex-to-pdf-process (list texcmd)))

;; (add-hook 'org-export-latex-after-initial-vars-hook 'my-auto-tex-cmd)

;; ;; Default packages included in every tex file, pdflatex or xelatex
;; (setq org-export-latex-packages-alist
;;       '(("" "graphicx" t)
;; 	("" "longtable" nil)
;; 	("" "float" nil)))


(add-hook 'LaTeX-mode-hook
          (lambda ()
            ;; Enable source-specials for Control-click forward/reverse search.
            (TeX-PDF-mode 1)
            (TeX-source-correlate-mode 1)
            (setq TeX-source-correlate-method 'synctex)

            (setq TeX-view-program-list
                  '(("Skim"
                     "/Applications/Skim.app/Contents/SharedSupport/displayline -g %n %o %b"))
                  TeX-view-program-selection
                  '((output-pdf "Skim")))))

;; (defun my-auto-tex-parameters ()
;;   "Automatically select the tex packages to include."
;;   ;; default packages for ordinary latex or pdflatex export
;;   (setq org-export-latex-default-packages-alist
;; 	'(("AUTO" "inputenc" t)
;; 	  ("T1"   "fontenc"   t)
;; 	  (""     "fixltx2e"  nil)
;; 	  (""     "wrapfig"   nil)
;; 	  (""     "soul"      t)
;; 	  (""     "textcomp"  t)
;; 	  (""     "marvosym"  t)
;; 	  ("nointegrals" "wasysym"   t)
;; 	  (""     "latexsym"  t)
;; 	  (""     "amssymb"   t)
;; 	  (""     "amsmath"   t)
;; 	  (""     "hyperref"  nil)))
  
;;   ;; Packages to include when xelatex is used
;;   ;; (see https://github.com/kjhealy/latex-custom-kjh for the 
;;   ;; non-standard ones.)
;;   (if (string-match "LATEX_CMD: xelatex" (buffer-string))
;;       (setq org-export-latex-default-packages-alist
;; 	    '(("" "fontspec" t)
;; 	      ("" "xunicode" t)
;; 	      ("" "url" t)
;; 	      ("" "rotating" t)
;; ;;	      ("" "memoir-article-styles" t)
;; ;;	      ("american" "babel" t)
;; 	      ("babel" "csquotes" t)
;; 	      ("" "listings" nil)
;; 	      (""     "amssymb"   t)
;; 	      (""     "amsmath"   t)
;; ;;	      ("" "listings-sweave-xelatex" nil)
;; 	      ("svgnames" "xcolor" t)
;; 	      ("" "soul" t)
;; 	      ("xetex, colorlinks=true, urlcolor=FireBrick, plainpages=false, pdfpagelabels, bookmarksnumbered" "hyperref" nil)
;; 	      )))
  
;;   ;; (if (string-match "LATEX_CMD: xelatex" (buffer-string))
;;   ;;     (setq org-export-latex-classes
;;   ;; 	    (cons '("article"
;;   ;; 		    "\\documentclass[letterpaper]{article}
;;   ;; \\usepackage[style=authoryear-comp-ajs, abbreviate=true]{biblatex}
;;   ;; \\bibliography{refs}"
;;   ;; 		    ("\\section{%s}" . "\\section*{%s}")
;;   ;; 		    ("\\subsection{%s}" . "\\subsection*{%s}")
;;   ;; 		    ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
;;   ;; 		    ("\\paragraph{%s}" . "\\paragraph*{%s}")
;;   ;; 		    ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
;;   ;; 		  org-export-latex-classes)))
;; )

;; (add-hook 'org-export-latex-after-initial-vars-hook 'my-auto-tex-parameters)

(add-hook 'LaTeX-mode-hook 'turn-on-reftex)
#+END_SRC

*** Display images inline after code evaluation

HT: https://github.com/erikriverson/org-mode-R-tutorial/blob/master/org-mode-R-tutorial.org

TODO: only run org-display-inline-images after execution if STARTUP: inlineimages is set
#+begin_src emacs-lisp
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
(add-hook 'org-mode-hook 'org-display-inline-images)
#+end_src 
*** org-src

bind s-s to org-edit-src-save:

#+BEGIN_SRC emacs-lisp
(add-hook 'org-src-mode-hook (lambda ()
                               (local-set-key (kbd "s-s") 'org-edit-src-save)))
#+END_SRC

** Church
#+BEGIN_SRC emacs-lisp
(require 'church)
(setq quack-fontify-style nil)
(setq quack-programs (quote ("o" "bigloo" "csi" "csi -hygienic" "gosh" "gracket" "gsi" "gsi ~~/syntax-case.scm -" "guile" "kawa" "mit-scheme" "racket" "racket -il typed/racket" "rs" "scheme" "scheme48" "scsh" "sisc" "stklos" "sxi" "ikarus" "ssh -t alonzo@nospoon.mit.edu ikarus")))
#+END_SRC

** Haskell
#+begin_src emacs-lisp
(load "haskell-site-file")
(add-hook 'haskell-mode-hook 'turn-on-haskell-doc-mode)
(add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
#+end_src
** Tuareg (OCaml)
#+begin_src emacs-lisp
;;; append-tuareg.el - Tuareg quick installation: Append this file to .emacs.
(setq auto-mode-alist (cons '("\\.ocaml\\w?" . tuareg-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.ml\\w?" . tuareg-mode) auto-mode-alist))
(autoload 'tuareg-mode "tuareg" "Major mode for editing Caml code" t)
(autoload 'camldebug "camldebug" "Run the Caml debugger" t)
#+end_src
** LaTeX
#+begin_src emacs-lisp
(setq LaTeX-command "latex -synctex=1")
#+end_src

Helper function for git-friendly formatting
bind to M-n
#+begin_src emacs-lisp
(defun tex-git-friendly ()
  (interactive)
  (replace-string ". " ".\n" nil (region-beginning) (region-end))
  )

(defun LaTeX-mode-keys ()
  "Modify keymaps used by `LaTeX-mode'."

  ;; format a selection in a git-friendly manner (one line per paragraph)
  (local-set-key (kbd "M-n") 'tex-git-friendly)
  ;; shortcut for bold
  (local-set-key (kbd "s-b") (lambda ()  (interactive) (TeX-font nil ?\C-b)))
  ;; shortcut for italic italic
  (local-set-key (kbd "s-i") (lambda ()  (interactive) (TeX-font nil ?\C-e))) 
  )

(add-hook 'LaTeX-mode-hook 'LaTeX-mode-keys)
#+end_src

visual line mode
#+BEGIN_SRC emacs-lisp
(add-hook 'LaTeX-mode-hook (lambda ()
                           (visual-line-mode 1)))
#+END_SRC

** js2
2013/03/19: installed and compiled according to https://code.google.com/p/js2-mode/wiki/InstallationInstructions

But note that I change the filename from js2 to js2-mode, so I had to change the second argument of the autoload line below

2013/03/21: apparently Steve Yegge's google code repository is no longer under active development, so I reinstalled from the mooz github repository (https://github.com/mooz/js2-mode)


#+begin_src emacs-lisp
(autoload 'js2-mode "js2-mode" nil t)
(add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
#+end_src
*** Declaring globals

js2-mode underlines undefined variables, which might actually be defined because, say, they're included in a different script. On the emacswiki page, Tim Meadowcroft has a fix for this

http://emacswiki.org/emacs/Js2Mode

#+begin_src emacs-lisp
;; After js2 has parsed a js file, we look for jslint globals decl comment ("/* global Fred, _, Harry */") and
;; add any symbols to a buffer-local var of acceptable global vars
;; Note that we also support the "symbol: true" way of specifying names via a hack (remove any ":true"
;; to make it look like a plain decl, and any ':false' are left behind so they'll effectively be ignored as
;; you can;t have a symbol called "someName:false"
(add-hook 'js2-post-parse-callbacks
	  (lambda ()
	    (when (> (buffer-size) 0)
	      (let ((btext (replace-regexp-in-string
			    ": *true" " "
			    (replace-regexp-in-string "[\n\t ]+" " " (buffer-substring-no-properties 1 (buffer-size)) t t))))
		(mapc (apply-partially 'add-to-list 'js2-additional-externs)
		      (split-string
		       (if (string-match "/\\* *global *\\(.*?\\) *\\*/" btext) (match-string-no-properties 1 btext) "")
		       " *, *" t))
		))))
#+end_src

*** Allow missing semi colons
#+begin_src emacs-lisp
;(setq js2-missing-semi-one-line-override t)
(setq js2-strict-missing-semi-warning nil)
#+end_src

*** Soft tabs

Do soft tabs in javascript and use only 4 spaces rather than 8

HT http://stackoverflow.com/a/7957258/351392 for indent-tabs-mode and js2-mode-hook parts

#+begin_src emacs-lisp
(setq js2-mode-hook
  '(lambda () (progn
    (setq indent-tabs-mode nil)
    (setq js2-basic-offset 4))))
#+end_src

TODO: figre out how to globally set js2-basic-offset to 2, rather than patching it in with the mode hook

** Python
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(setq-default tab-width 2)
#+end_src

#+RESULTS:
: 2


   #+begin_src emacs-lisp
(add-hook 'python-mode-hook
          (function (lambda ()
                      (setq indent-tabs-mode nil
                            tab-width 2
                            python-indent-offset 2 ;; HT http://www.emacswiki.org/emacs/IndentingPython
                            ))))
   #+end_src

   #+RESULTS:
   | er/add-python-mode-expansions | make-enter-indent | (lambda nil (setq indent-tabs-mode nil tab-width 2)) |


** Markdown
   #+begin_src emacs-lisp
     (autoload 'markdown-mode "markdown-mode"
       "Major mode for editing Markdown files" t)
     (add-to-list 'auto-mode-alist '("\\.text\\'" . markdown-mode))
     (add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
     (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
   #+end_src


   I'm apparently using the markdown parser from Ruby's gems, which doesn't play nice with markdown previews / exports. 
   #+begin_src emacs-lisp
(custom-set-variables '(markdown-command "~/Library/Haskell/bin/pandoc"))
   #+end_src

   Use a css file in ~/dot-emacs/markdown.css (FIXME: doesn't work currently)
   #+begin_src emacs-lisp
(custom-set-variables '(markdown-css-path "//localhost/Users/longouyang/dot-emacs/markdown.css"))
   #+end_src

   #+RESULTS:

