emacs.org
** shell

   good directory tracking (so autocomplete works even after I use z to jump around)
   HT http://www.emacswiki.org/emacs/ShellDirtrackByProcfs

   by default, on osx, the messages buffer complains about:
   #+BEGIN_EXAMPLE
error in process filter: locate-file: Wrong type argument: stringp, nil
error in process filter: Wrong type argument: stringp, nil
   #+END_EXAMPLE

   this is because /proc doesn't exist. i had to hack this in using lsof (HT http://stackoverflow.com/a/8331292/351392)

   #+begin_src emacs-lisp
(defun track-shell-directory/procfs ()
  (shell-dirtrack-mode 0)
  (add-hook 'comint-preoutput-filter-functions
            (lambda (str)
              (prog1 str
                (when (string-match comint-prompt-regexp str) 
                  (cd
                   (car (last (split-string (shell-command-to-string (format "lsof -d cwd | grep %s | tail -1 | tr -d \"\n\" | sed 's/[ \t]*//' "
                                                                             (process-id (get-buffer-process (current-buffer)))))
                                            " ")))
                   ;; (file-symlink-p
                      ;;  (format "/proc/%s/cwd" (process-id
                      ;;                          (get-buffer-process
                      ;;                           (current-buffer)))))
                      ))))
            nil t)
  )

(add-hook 'shell-mode-hook 'track-shell-directory/procfs)
   #+end_src

   helper function to load shell based on current buffer's directory

   #+BEGIN_SRC emacs-lisp
   (require 'shell-current-directory)
   #+END_SRC
   
** dired

   Cut details from dired listing
   HT http://www.emacswiki.org/emacs/DiredDetails
   #+begin_src emacs-lisp 
(require 'dired-details)
(dired-details-install)
(set-variable 'dired-details-hidden-string "- ")
   #+end_src

   List directories first
   HT http://www.emacswiki.org/emacs/DiredSortDirectoriesFirst
   #+begin_src emacs-lisp
   (setq dired-listing-switches "-alXGh --group-directories-first")
   #+end_src

** julia
   #+BEGIN_SRC emacs-lisp
(require 'julia-mode)
   #+END_SRC
* Minor modes
** Ace jump mode
#+BEGIN_SRC emacs-lisp
(autoload
  'ace-jump-mode
  "ace-jump-mode"
  "Emacs quick move minor mode"
  t)

(autoload
  'ace-jump-mode-pop-mark
  "ace-jump-mode"
  "Ace jump back:-)"
  t)

(setq ace-jump-mode-scope 'frame)

(eval-after-load "ace-jump-mode"
  '(ace-jump-mode-enable-mark-sync))
(define-key global-map (kbd "C-x SPC") 'ace-jump-mode-pop-mark)
#+END_SRC

** Magit
used to be vendored, but installed from elpa
   
Bind M-g to magit-status

#+begin_src emacs-lisp
(global-set-key (kbd "M-g") 'magit-status)
#+end_src


show fine differences at current hunk
HT https://github.com/vincentbernat/dot.emacs/blob/master/magit.conf.el
HT google for < "word-diff" magit >
#+BEGIN_SRC emacs-lisp
(setq magit-diff-refine-hunk t) 
#+END_SRC

** Paredit
#+begin_src emacs-lisp
  (autoload 'paredit-mode "paredit"
    "Minor mode for pseudo-structurally editing Lisp code." t)
  (add-hook 'emacs-lisp-mode-hook       (lambda () (paredit-mode +1)))
  (add-hook 'lisp-mode-hook             (lambda () (paredit-mode +1)))
  (add-hook 'lisp-interaction-mode-hook (lambda () (paredit-mode +1)))
  (add-hook 'scheme-mode-hook           (lambda () (paredit-mode +1)))
#+end_src

#+RESULTS:

Use electric-pair-mode for non-lisps:
#+begin_src emacs-lisp
  ;; HT http://stackoverflow.com/a/913823/351392
  ;; HT http://stackoverflow.com/questions/5298907/emacs-php-mode-and-paredit#comment12995031_5324458
  
  (electric-pair-mode)
#+end_src

* Misc

** rename file and buffer
#+BEGIN_SRC emacs-lisp
(defun rename-file-and-buffer (new-name)
  "Renames both current buffer and file it's visiting to NEW-NAME."
  (interactive "sNew name: ")
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not filename)
        (message "Buffer '%s' is not visiting a file!" name)
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (rename-file name new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil))))))
#+END_SRC

* Keyboard
** Enter indents

HT http://emacswiki.org/emacs/AutoIndentation
#+begin_src emacs-lisp
(defun make-enter-indent ()
  (local-set-key (kbd "RET") 'newline-and-indent))

(add-hook 'js2-mode-hook 'make-enter-indent)
(add-hook 'python-mode-hook 'make-enter-indent)
(add-hook 'html-mode-hook 'make-enter-indent)
(add-hook 'org-mode-hook 'make-enter-indent)
#+end_src


** Copy/paste
#+BEGIN_SRC emacs-lisp
;; emacs 23.1 and later joins the system clipboard with the
;; emacs killring. get rid of this.
;; taken from: http://emacswiki.org/emacs/CopyAndPaste#toc10
;; (setq interprogram-cut-function 'x-select-text)
;; (setq interprogram-paste-function x-cut-buffer-or-selection-value)
(setq interprogram-cut-function nil)
(setq interprogram-paste-function nil)
(defun paste-from-pasteboard ()
  (interactive)
  (and mark-active (filter-buffer-substring (region-beginning) (region-end) t))
  (insert (ns-get-pasteboard))
  )
(defun copy-to-pasteboard (p1 p2)
  (interactive "r*")
  (ns-set-pasteboard (buffer-substring p1 p2))
  (message "Copied selection to pasteboard")
  )
(defun cut-to-pasteboard (p1 p2) (interactive "r*") (ns-set-pasteboard (filter-buffer-substring p1 p2 t)) )
(global-set-key (kbd "s-v") 'paste-from-pasteboard)
(global-set-key (kbd "s-c") 'copy-to-pasteboard)
(global-set-key (kbd "s-x") 'cut-to-pasteboard)
#+END_SRC

** Autoindent yanked code
Make sure pasted code is automatically indented, HT http://emacswiki.org/emacs/AutoIndentation
#+begin_src emacs-lisp
(dolist (command '(yank yank-pop))
  (eval `(defadvice ,command (after indent-region activate)
	   (and (not current-prefix-arg)
		(member major-mode '(emacs-lisp-mode lisp-mode
						     clojure-mode    scheme-mode
						     haskell-mode    ruby-mode
						     rspec-mode      python-mode
						     c-mode          c++-mode
						     objc-mode       latex-mode
						     plain-tex-mode  js2-mode
						     html-mode))
		(let ((mark-even-if-inactive transient-mark-mode))
		  (indent-region (region-beginning) (region-end) nil))))))
#+end_src

#+RESULTS:

** Comments
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c C-=") 'comment-region)
(global-set-key (kbd "C-c C--") 'uncomment-region)
#+END_SRC

** Next/previous window

#+BEGIN_SRC emacs-lisp
(defun prev-window ()
  (interactive)
  (other-window -1))

(defun longs-next-window ()
  (interactive)
  (other-window 1))

(global-set-key (kbd "C-x p") 'prev-window)
(global-set-key (kbd "s-}") 'longs-next-window)
(global-set-key (kbd "s-{") 'prev-window)
#+END_SRC

** windmove ("geographic"  window switching)

   HT http://www.emacswiki.org/emacs/SwitchingBuffers#toc8
   
#+begin_src emacs-lisp
(global-set-key (kbd "<s-left>") 'windmove-left) 
(global-set-key (kbd "<s-right>") 'windmove-right) 
(global-set-key (kbd "<s-up>") 'windmove-up) 
(global-set-key (kbd "<s-down>") 'windmove-down)
#+end_src

** delete-window

   s-0 as a shorter version of C-x 0

   #+begin_src emacs-lisp
   (global-set-key (kbd "s-0") 'delete-window)
   #+end_src

** Go to indent
Remap from default M-m to M-i
HT http://emacsrocks.com/e04.html (around 1:15 in video)
#+begin_src emacs-lisp
(define-key global-map (kbd "M-i") 'back-to-indentation)
#+end_src 
** Key chords
#+begin_src emacs-lisp
(require 'key-chord)
(key-chord-mode 1)
(key-chord-define-global "jk" 'ace-jump-mode)
#+end_src

** M-m replace-string M-M replace-regexp
#+begin_src emacs-lisp
(global-set-key (kbd "M-m") 'replace-string)
#+end_src

   #+begin_src emacs-lisp
(global-set-key (kbd "M-M") 'replace-regexp)
#+end_src


* todo setup

  #+begin_src emacs-lisp
    (defun tdo ()
      (interactive)
    
    ;; HT http://www.gnu.org/software/emacs/manual/html_node/emacs/Select-Buffer.html
      (switch-to-buffer-other-frame "todo"))
    
  #+end_src

* lazy writing (capitalize heads of sentences)

  epic fail
  #+begin_comment
    (defun replace-regexp (regexp to-string &optional delimited start end)
    ;;  (message to-string)
      (interactive
       (let ((common
              (query-replace-read-args
               (concat "Replace"
                       (if current-prefix-arg " word" "")
                       " regexp"
                       (if (and transient-mark-mode mark-active) " in region" ""))
               t)))
         (list (nth 0 common) (nth 1 common) (nth 2 common)
               (if (and transient-mark-mode mark-active)
                   (region-beginning))
               (if (and transient-mark-mode mark-active)
                   (region-end)))))
      (perform-replace regexp to-string nil t delimited nil nil start end))
    
    (defun capitalize-head ()
      (interactive)
       (replace-regexp "\\(^\\|\\. \\)\\([a-z]\\)"
                      (replace-eval-replacement concat "\\1" (replace-quote (upcase (match-string 2))))))
    
    a b c. d e f. g h i.
    
    
  #+end_comment


* custom face setting
  #+begin_src emacs-lisp
 ;;  (custom-set-faces
 ;; ;; custom-set-faces was added by Custom.
 ;; ;; If you edit it by hand, you could mess it up, so be careful.
 ;; ;; Your init file should contain only one such instance.
 ;; ;; If there is more than one, they won't work right.
 ;;  '(org-block ((t (:inherit shadow :background "DarkSlateGray" :foreground "Black")))))
  #+end_src

  #+RESULTS:



* git

  use --word-diff in magit-diff-options (TODO: colors don't actually show up)
  #+begin_src emacs-lisp
  ;; (setq magit-diff-options (list "--color" "--word-diff=color"))
  (setq magit-diff-options nil)
  #+end_src


* list of installed packages 
  * yasnippet (ELPA)
    installed 2014/01/09
  * auctex (ELPA)
    installed 2014/01/11
    updated from "11.87.2012-12-04" to ""  2014/11/07
  * adding marmalade as a source

    #+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives 
    '("marmalade" .
      "http://marmalade-repo.org/packages/"))
(package-initialize)
    #+END_SRC
   
  * load-theme-buffer-local (marmalade)

    installed 2014/02/01
  
    HT http://lists.gnu.org/archive/html/help-gnu-emacs/2012-10/msg00431.html (googled)
    HT https://github.com/vic/color-theme-buffer-local

    
